In [25]:
import os
os.chdir("//Users//chengqian//Desktop//")

In [26]:
import pandas as pd
iris=pd.read_csv("iris.csv")
iris.head()

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

# 1、复习上次课的知识

## (1)列的取法—名称索引、点取法

In [5]:
#取出Species这一列的方法

In [7]:
iris['Species'].head(2)

0    setosa
1    setosa
Name: Species, dtype: object

In [8]:
iris.Species.head(2)

0    setosa
1    setosa
Name: Species, dtype: object

In [9]:
#一个变量的观测筛选
#取出setosa花种

In [10]:
iris.loc[iris.Species=='setosa',:].head(3)

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [12]:
#两个变量的观测筛选,注意多变量筛选要用圆括号括起来
iris.loc[(iris.Species=='setosa')&(iris['Sepal_Length']>5),:].head()

    Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0            5.1          3.5           1.4          0.2  setosa
5            5.4          3.9           1.7          0.4  setosa
10           5.4          3.7           1.5          0.2  setosa
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa

In [15]:
#两个变量的观测筛选并筛选部分变量
iris.loc[(iris.Species=='setosa')&(iris['Sepal_Length']>5),['Sepal_Length','Sepal_Width']].head()

    Sepal_Length  Sepal_Width
0            5.1          3.5
5            5.4          3.9
10           5.4          3.7
14           5.8          4.0
15           5.7          4.4

## 总结：虽然变量筛选可以用loc和iloc，但更推荐用loc的方法。

# 2、基本数据整理

## (1)变量的删除

In [17]:
#使用drop函数删除指定列
##删除Sepal_Length和Species变量
iris.drop(['Sepal_Length','Species'],axis=1).head()

   Sepal_Width  Petal_Length  Petal_Width
0          3.5           1.4          0.2
1          3.0           1.4          0.2
2          3.2           1.3          0.2
3          3.1           1.5          0.2
4          3.6           1.4          0.2

In [18]:
#备注：axis=0是默认的，表示删除行；删除列是axis=1
#此时，iris数据集没有发生改变，如果需要改变数据集，设置inplace=True

## (2)变量重命名

In [19]:
#使用rename重新命名
iris.columns

Index(['Sepal_Length', 'Sepal_Width', 'Petal_Length', 'Petal_Width',
       'Species'],
      dtype='object')

In [23]:
iris.rename(columns={'Sepal_Length':'Sepal.Length','Sepal_Width':'Sepal.Width'},inplace=True)
iris.head()

   Sepal.Length  Sepal.Width  Petal_Length  Petal_Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

## (3)数据类型转化

In [24]:
data=pd.DataFrame({'id':range(4),'age':['13','18','11','18'],'outcome':['15.3','10.8','13.7',11.4]})
data

  age  id outcome
0  13   0    15.3
1  18   1    10.8
2  11   2    13.7
3  18   3    11.4

In [25]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
age        4 non-null object
id         4 non-null int32
outcome    4 non-null object
dtypes: int32(1), object(2)
memory usage: 160.0+ bytes

In [29]:
data.dtypes

age        object
id          int32
outcome    object
dtype: object

In [31]:
#通过astype实现
data['age']=data.age.astype(int)
data['outcome']=data.outcome.astype(float)

In [32]:
data.dtypes

age          int32
id           int32
outcome    float64
dtype: object

In [33]:
#或者通过字典的方式更改
data=data.astype({'outcome':'float','age':'int'})

# (4)、数据集排序

In [34]:
iris.head()

   Sepal.Length  Sepal.Width  Petal_Length  Petal_Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [36]:
iris.sort_values(by=['Sepal.Length'],ascending='True').head()

    Sepal.Length  Sepal.Width  Petal_Length  Petal_Width Species
13           4.3          3.0           1.1          0.1  setosa
42           4.4          3.2           1.3          0.2  setosa
38           4.4          3.0           1.3          0.2  setosa
8            4.4          2.9           1.4          0.2  setosa
41           4.5          2.3           1.3          0.3  setosa

# (5)、数据去重

In [37]:
data

   age  id  outcome
0   13   0     15.3
1   18   1     10.8
2   11   2     13.7
3   18   3     11.4

In [38]:
data.id=[0,1,2,1]

In [39]:
data.outcome=[15.3,10.8,13.7,10.8]

In [40]:
data

   age  id  outcome
0   13   0     15.3
1   18   1     10.8
2   11   2     13.7
3   18   1     10.8

In [42]:
#检测观测是否重复duplicated
data.duplicated()

0    False
1    False
2    False
3     True
dtype: bool

In [43]:
#删除重复值duplicates
data.drop_duplicates()

   age  id  outcome
0   13   0     15.3
1   18   1     10.8
2   11   2     13.7

# (6)、抽样

In [44]:
#使用sample函数完成抽样任务
#sample(n,frac,replace,weights,random_state)
#n:抽样个数
#frac:比例
#replace:是否有放回
#weight:默认相等
#random_state:抽样随机种子，默认无固定种子，即每次抽样结果不一样

In [45]:
#训练集
train=iris.sample(frac=0.8)

In [46]:
#测试集
test=iris.loc[~iris.index.isin(train.index)]

# 3、数据管理高阶

## (1) 频数统计

In [48]:
iris.head()

   Sepal.Length  Sepal.Width  Petal_Length  Petal_Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [49]:
#统计(单变量)某个离散变量个水平的频次-value_counts()
iris.Species.value_counts()

versicolor    50
setosa        50
virginica     50
Name: Species, dtype: int64

In [50]:
#计算每类的百分比
iris.Species.value_counts()/sum(iris.Species.value_counts())

versicolor    0.333333
setosa        0.333333
virginica     0.333333
Name: Species, dtype: float64

In [ ]:
#统计(多变量交叉频次)两个离散变量的交叉统计表，crosstab

In [59]:
iris['Sepal.Length'].dtypes

dtype('float64')

In [99]:
iris.Petal_Width.min()

0.10000000000000001

In [103]:
qujian=[iris['Sepal.Length'].min(),6,6.5,iris['Sepal.Length'].max()]
qujian

[4.2999999999999998, 6, 6.5, 7.9000000000000004]

In [109]:
iris['new']=pd.cut(iris['Sepal.Length'],qujian,labels=['A','B','C'])

In [112]:
iris['new'].value_counts()

A    88
B    31
C    30
Name: new, dtype: int64

In [113]:
iris.head()

   Sepal.Length  Sepal.Width  Petal_Length  Petal_Width Species new
0           5.1          3.5           1.4          0.2  setosa   A
1           4.9          3.0           1.4          0.2  setosa   A
2           4.7          3.2           1.3          0.2  setosa   A
3           4.6          3.1           1.5          0.2  setosa   A
4           5.0          3.6           1.4          0.2  setosa   A

In [114]:
pd.crosstab(iris.Species,iris.new)

Sepal.Length   A   B   C
Species
setosa        49   0   0
versicolor    30  12   8
virginica      9  19  22

## （2）缺失值处理

In [1]:
#对于缺失值如何理解？缺失值可以通过删除或替补的方式来处理。首先监控每个变量是否存在缺失，缺失比例如何？这里借助pandas库中的
#isnull、dropna、fillna函数

In [5]:
#首先，建立一个含有缺失值的数据框
import pandas as pd
import numpy as np
df=pd.DataFrame([[1,2,3,4],[np.NaN,6,7,np.NaN],[11,np.NaN,12,13],[100,200,300,400],[20,40,60,np.NaN]],columns=['x1','x2','x3','x4'])

In [6]:
df

      x1     x2   x3     x4
0    1.0    2.0    3    4.0
1    NaN    6.0    7    NaN
2   11.0    NaN   12   13.0
3  100.0  200.0  300  400.0
4   20.0   40.0   60    NaN

In [7]:
#其次，使用isnull函数检查数据集缺失情况
##1、总揽数据集是否存在缺失
any(df.isnull())

True

In [17]:
##2、每一列是否有缺失，及缺失比例
is_null=[]
null_rato=[]
for col in df.columns:
    is_null.append(pd.isnull(df[col]))
    null_rato.append(float(sum(pd.isnull(df[col]))/df.shape[0]))

In [21]:
null_rato

[0.2, 0.2, 0.0, 0.4]

In [19]:
##3、每一行是否有缺失
is_null=[]
for index in list(df.index):
    is_null.append(any(pd.isnull(df.iloc[index,:])))

In [20]:
is_null

[False, True, True, False, True]

In [22]:
##4、对缺失数据进行处理，使用dropna函数，这里有两种删除方式
###（1）删除任何含缺失值的观测
df.dropna()

      x1     x2   x3     x4
0    1.0    2.0    3    4.0
3  100.0  200.0  300  400.0

In [ ]:
### (2)删除每行中所有变量都为缺失的观测

In [23]:
df.dropna(how='all')

      x1     x2   x3     x4
0    1.0    2.0    3    4.0
1    NaN    6.0    7    NaN
2   11.0    NaN   12   13.0
3  100.0  200.0  300  400.0
4   20.0   40.0   60    NaN

In [24]:
##5、替补法，使用fillna函数，不同的列用不同的函数替补
df.fillna(value={'x1':df.x1.mean(),'x2':df.x2.mean(),'x4':df.x4.mean()})

      x1     x2   x3     x4
0    1.0    2.0    3    4.0
1   33.0    6.0    7  139.0
2   11.0   62.0   12   13.0
3  100.0  200.0  300  400.0
4   20.0   40.0   60  139.0

## （3）数据映射

In [ ]:
#映射函数apply可以解决循环效率低的问题，该函数的目的就是将用户指定的函数运用到数据集的每个变量或者每个行
#例如： 对于iris数据计算每类Species的平均Sepal_Length

In [27]:
import pandas as pd
iris=pd.read_csv("iris.csv")
iris.head()

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [34]:
#1、计算每多花的Sepal_Length	Sepal_Width的总和
iris['ssum']=iris.iloc[:,0:2].apply(np.sum,axis=1)
iris.head()

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species  ssum
0           5.1          3.5           1.4          0.2  setosa   8.6
1           4.9          3.0           1.4          0.2  setosa   7.9
2           4.7          3.2           1.3          0.2  setosa   7.9
3           4.6          3.1           1.5          0.2  setosa   7.7
4           5.0          3.6           1.4          0.2  setosa   8.6

In [35]:
#2、计算每个叶子的指标的均值
iris.iloc[:,0:4].apply(np.mean,axis=0)

Sepal_Length    5.843333
Sepal_Width     3.054000
Petal_Length    3.758667
Petal_Width     1.198667
dtype: float64

## （4）数据汇总

In [36]:
#数据汇总使用groupby函数与aggregate函数一起使用
#以iris数据为例
iris.head()

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species  ssum
0           5.1          3.5           1.4          0.2  setosa   8.6
1           4.9          3.0           1.4          0.2  setosa   7.9
2           4.7          3.2           1.3          0.2  setosa   7.9
3           4.6          3.1           1.5          0.2  setosa   7.7
4           5.0          3.6           1.4          0.2  setosa   8.6

In [39]:
#1、对species做分组统计
groupby_iris=iris.groupby(['Species']).agg(np.mean)
groupby_iris

            Sepal_Length  Sepal_Width  Petal_Length  Petal_Width   ssum
Species
setosa             5.006        3.418         1.464        0.244  8.424
versicolor         5.936        2.770         4.260        1.326  8.706
virginica          6.588        2.974         5.552        2.026  9.562

In [ ]:
#2、还可以对两个变量做分组统计